---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.BuiltInFailures.PipingFailures
source: html/dcef5565-04d9-4931-5a18-888578492d84.htm
---
# BuiltInFailures.PipingFailures Members

Provides a container of all Revit built-in FailureDefinitionId instances.